#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 24262                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: m5rep5wer <boj.kr/u/m5rep5wer>              +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/24262                          #+#        #+#      #+#     #
#    Solved: 2024/08/12 16:04:13 by m5rep5wer     ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

## 문제 풀이
# 알고리즘의 개념 중 시간 복잡도에 대한 문제입니다.
# 주어진 MOP의 코드를 해석하고, 해당하는 시간복잡도의 출력이 나오도록 작성하면 됩니다.
# 이 문제는 시간복잡도 중, 

print(1)
print(0)